Repository: thatsmeee/video-loader
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: 🔹 Main features:
ru: 🔹 Основные функции:
uk: 🔹 Основні функції:

source: 1. Paste the video URL in the "Video URL" field
ru: 1. Вставьте URL видео в поле "Video URL"
uk: 1. Вставте URL відео у поле "Video URL"

source: 2. Select the format (mp4, mp3, etc.)
ru: 2. Выберите формат (mp4, mp3 и др.)
uk: 2. Оберіть формат (mp4, mp3 тощо)

source: 3. Specify the quality (for example: best, 720, 480)
ru: 3. Укажите качество (например: best, 720, 480)
uk: 3. Вкажіть якість (наприклад: best, 720, 480)

source: 4. Select the folder to save
ru: 4. Выберите папку для сохранения
uk: 4. Оберіть папку для збереження

source: 5. Click "Download"
ru: 5. Нажмите "Скачать"
uk: 5. Натисніть "Завантажити"

source: 🔹 Additional features:
ru: 🔹 Дополнительные функции:
uk: 🔹 Додаткові функції:

source: - Convert video to other formats
ru: - Конвертация видео в другие форматы
uk: - Конвертація відео в інші формати

source: - Trim video by time
ru: - Обрезка видео по времени
uk: - Обрізка відео за часом

source: - Extract audio from video
ru: - Извлечение аудио из видео
uk: - Витяг аудіо з відео

source: - Merge multiple videos
ru: - Объединение нескольких видео
uk: - Об'єднання кількох відео

source: - Download queue with control (pause/cancel)
ru: - Очередь загрузок с управлением (пауза/отмена)
uk: - Черга завантажень з керуванням (пауза/скасування)

source: - Optimize CPU/GPU usage during conversion
ru: - Оптимизация использования ЦП/ГП при конвертации
uk: - Оптимізація використання ЦП/ГП під час конвертації

source: 🔹 Hot keys:
ru: 🔹 Горячие клавиши:
uk: 🔹 Гарячі клавіші:

source: - Ctrl+V: Paste URL from clipboard
ru: - Ctrl+V: Вставить URL из буфера обмена
uk: - Ctrl+V: Вставити URL з буфера обміну

source: - F1: Open this help
ru: - F1: Открыть эту справку
uk: - F1: Відкрити цю довідку

source: - Ctrl+Q: Quickly view videos
ru: - Ctrl+Q: Быстрый просмотр видео
uk: - Ctrl+Q: Швидкий перегляд відео

source: 🔹 Supported sites:
ru: 🔹 Поддерживаемые сайты:
uk: 🔹 Підтримувані сайти:

source: - And many more (see Search tab)
ru: - И многие другие (см. вкладку Поиск)
uk: - Та багато інших (див. вкладку Пошук)

source: For more help visit:
ru: Для дополнительной помощи посетите:
uk: Щоб отримати більше допомоги, відвідайте:

source: Usage manual
ru: Руководство пользователя
uk: Посібник користувача

source: 📚 Enhanced YouTube Downloader - Help
ru: 📚 Enhanced YouTube Downloader - Справка
uk: 📚 Enhanced YouTube Downloader - Довідка

source: 🔧 Advanced
ru: 🔧 Дополнительно
uk: 🔧 Додатково

source: 🔍 Search
ru: 🔍 Поиск
uk: 🔍 Пошук

source: 🎬 Tools
ru: 🎬 Инструменты
uk: 🎬 Інструменти

source: ⚙️ Security
ru: ⚙️ Безопасность
uk: ⚙️ Безпека

source: ⏳ History
ru: ⏳ История
uk: ⏳ Історія

source: 📜 Queue
ru: 📜 Очередь
uk: 📜 Черга

source: 🎞 Format (mp3, mp4, ogg etc.):
ru: 🎞 Формат (mp3, mp4, ogg и др.):
uk: 🎞 Формат (mp3, mp4, ogg тощо):

source: 🧩 Quality (worst/best, 360/720/1800 etc.):
ru: 🧩 Качество (наихудшее/наилучшее, 360/720/1800 и др.):
uk: 🧩 Якість (найгірша/найкраща, 360/720/1800 тощо):

source: 📦 Codec (opus, vp9 etc.) (optional):
ru: 📦 Кодек (opus, vp9 и др.) (необязательно):
uk: 📦 Кодек (opus, vp9 тощо) (необов'язково):

source: 💿 Save directory:
ru: 💿 Папка для сохранения:
uk: 💿 Каталог для збереження:

source: 🎚 FFmpeg threads:
ru: 🎚 Потоки FFmpeg:
uk: 🎚 Потоки FFmpeg:

source: 📌 Download
ru: 📌 Скачать
uk: 📌 Завантажити

source: ➕ Add to Queue
ru: ➕ Добавить в очередь
uk: ➕ Додати до черги

source: 📜 Process log:
ru: 📜 Журнал процессов:
uk: 📜 Журнал процесів:

source: ✅ Download complete!
ru: ✅ Загрузка завершена!
uk: ✅ Завантаження завершено!

source: 🔧 Advanced Options
ru: 🔧 Дополнительные настройки
uk: 🔧 Додаткові параметри

source: 📋 Download entire playlist:
ru: 📋 Скачать весь плейлист:
uk: 📋 Завантажити весь плейлист:

source: 📝 Download subtitles:
ru: 📝 Скачать субтитры:
uk: 📝 Завантажити субтитри:

source: 📄 Subtitle format:
ru: 📄 Формат субтитров:
uk: 📄 Формат субтитрів:

source: 📊 Download metadata (description, tags, etc.):
ru: 📊 Скачать метаданные (описание, теги и др.):
uk: 📊 Завантажити дані відео (опис, теги тощо):

source: 🔊 Audio quality (kbps):
ru: 🔊 Качество аудио (кбит/с):
uk: 🔊 Якість аудіо (кбіт/с):

source: ⏱️ Start time (HH:MM:SS):
ru: ⏱️ Время начала (ЧЧ:ММ:СС):
uk: ⏱️ Час початку (ГГ:ХХ:СС):

source: ⏱️ End time (HH:MM:SS):
ru: ⏱️ Время окончания (ЧЧ:ММ:СС):
uk: ⏱️ Час завершення (ГГ:ХХ:СС):

source: 📝 Filename template:
ru: 📝 Шаблон имени файла:
uk: 📝 Шаблон імені файлу:

source: ⚡️ Hardware acceleration:
ru: ⚡️ Аппаратное ускорение:
uk: ⚡️ Апаратне прискорення:

source: ⬅️ Back
ru: ⬅️ Назад
uk: ⬅️ Назад

source: ⚙️ Security Settings
ru: ⚙️ Настройки безопасности
uk: ⚙️ Налаштування безпеки

source: 🌐 Cookie domain (e.g., youtube.com):
ru: 🌐 Домен cookie (например, youtube.com):
uk: 🌐 Домен cookie (наприклад, youtube.com):

source: 🔌 Proxy (e.g., http://user:pass@ip:port):
ru: 🔌 Прокси (например, http://user:pass@ip:port):
uk: 🔌 Проксі (наприклад, http://user:pass@ip:port):

source: From File
ru: Из файла
uk: З файлу

source: Clear
ru: Очистить
uk: Очистити

source: 📜 Download Queue
ru: 📜 Очередь загрузок
uk: 📜 Черга завантажень

source: ▶️ Start
ru: ▶️ Старт
uk: ▶️ Почати

source: ⏸️ Pause
ru: ⏸️ Пауза
uk: ⏸️ Пауза

source: ⏹️ Stop
ru: ⏹️ Стоп
uk: ⏹️ Зупинити

source: 🗑 Clear
ru: 🗑 Очистить
uk: 🗑 Очистити

source: Search supported websites
ru: Поиск поддерживаемых сайтов
uk: Пошук підтримуваних сайтів

source: 🔎 Search
ru: 🔎 Поиск
uk: 🔎 Пошук

source: 📄 Results:
ru: 📄 Результаты:
uk: 📄 Результати:

source: ⏳ Download History
ru: ⏳ История загрузок
uk: ⏳ Історія завантажень

source: 🔄 Repeat Download
ru: 🔄 Повторить загрузку
uk: 🔄 Повторити завантаження

source: 🗑 Clear History
ru: 🗑 Очистить историю
uk: 🗑 Очистити історію

source: 🎞 Media Converter
ru: 🎞 Медиа конвертер
uk: 🎞 Медіаконвертер

source: ✂️ Video trim
ru: ✂️ Обрезка видео
uk: ✂️ Обрізка відео

source: 🔊 Audio Extractor
ru: 🔊 Извлечение аудио
uk: 🔊 Витягти аудіо

source: 🔀 Merge Videos
ru: 🔀 Объединение видео
uk: 🔀 Об'єднання відео

source: Output audio format:
ru: Формат выходного аудио:
uk: Формат вихідного аудіо:

source: Audio quality (kbps):
ru: Качество аудио (кбит/с):
uk: Якість аудіо (кбіт/с):

source: 🎵 Extract Audio
ru: 🎵 Извлечь аудио
uk: 🎵 Витягнути аудіо

source: Enter output format (e.g., mp4, mkv, avi):
ru: Введите формат вывода (например, mp4, mkv, avi):
uk: Введіть формат виводу (наприклад, mp4, mkv, avi):

source: 🔄 Convert video
ru: 🔄 Конвертировать видео
uk: 🔄 Конвертувати відео

source: ✂️ Video trimming
ru: ✂️ Обрезка видео
uk: ✂️ Обрізка відео

source: Start time (format HH:MM:SS or seconds):
ru: Время начала (формат ЧЧ:ММ:СС или секунды):
uk: Час початку (формат ГГ:ХХ:СС або секунди):

source: End time (format HH:MM:SS or seconds):
ru: Время окончания (формат ЧЧ:ММ:СС или секунды):
uk: Час завершення (формат ГГ:ХХ:СС або секунди):

source: ✂️ Trim
ru: ✂️ Обрезать
uk: ✂️ Обрізати

source: 🔀 Video Merger
ru: 🔀 Объединение видео
uk: 🔀 Об'єднання відео

source: Select multiple video files to merge (same codec recommended):
ru: Выберите несколько видео для объединения (рекомендуется одинаковый кодек):
uk: Виберіть кілька відеофайлів для об'єднання (рекомендується однаковий кодек):

source: ➕ Add Files
ru: ➕ Добавить файлы
uk: ➕ Додати файли

source: ➖ Remove
ru: ➖ Удалить
uk: ➖ Видалити

source: 🔼 Up
ru: 🔼 Вверх
uk: 🔼 Вгору

source: 🔽 Down
ru: 🔽 Вниз
uk: 🔽 Вниз

source: Output format:
ru: Формат результата:
uk: Формат виводу:

source: 🆘 Справка (F1)
uk: 🆘 Довідка (F1)

source: 🔗 Video URL:
uk: 🔗 URL відео:

source: ⬅️ Back to main
uk: ⬅️ Назад до головного
